Revit 2026 API

# IFCExportOptions Properties

---

The IFCExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExportBaseQuantities | Option to export IFC standard quantities currently supported by Revit. |
|  | FamilyMappingFile | Path to a file containing family mapping. |
|  | FileVersion | IFC file version. |
|  | FilterViewId | Id of the view whose visibility settings will govern the contents in the exported IFC file. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SpaceBoundaryLevel | Level of space boundaries exported in IFC file. |
|  | WallAndColumnSplitting | Option to allow division of multi-level walls and columns by levels. |

#### Reference

IFCExportOptions Class

Autodesk.Revit.DB Namespace